# ============================================================================
# Brewfile - DevOps/SRE toolkit
# Install: brew bundle --file=~/.dotfiles/Brewfile
# ============================================================================

# --- Core replacements (modern unix tools) ---
brew "bat"              # cat with syntax highlighting
brew "eza"              # ls with icons, colors, tree
brew "fd"               # find, but intuitive
brew "ripgrep"          # grep, but 10x faster
brew "fzf"              # fuzzy finder for everything
brew "jq"               # JSON parser
brew "yq"               # YAML parser (like jq for YAML)

# --- TUI apps (interactive terminal UIs) ---
brew "lazygit"          # Git TUI
brew "lazydocker"       # Docker TUI
brew "k9s"              # Kubernetes TUI
brew "btop"             # System monitor (replaces htop)
brew "ncdu"             # Disk usage analyzer
brew "tldr"             # Simplified man pages

# --- Terminal multiplexer ---
brew "tmux"

# --- Editor ---
brew "neovim"

# --- DevOps essentials ---
brew "watch"            # Repeat commands (watch kubectl get pods)
brew "tree"             # Directory tree view
brew "wget"             # HTTP downloads
brew "curl"             # Should exist, but ensure it
brew "gnu-sed"          # GNU sed (macOS sed is BSD)
